# Generar Usuarios

In [9]:
import pandas as pd
from faker import Faker
import random

In [10]:
fake = Faker('es_ES')  # o 'es_ES'

In [11]:
rango = range(1,138494)

In [18]:
data = []
userid = 0
for i in rango:
    nombre = fake.name()
    email = nombre.lower().replace(" ", ".") + "@ejemplo.com"
    # edad = random.randint(18, 80)
    genero = random.choice(['M', 'F'])
    # nogenre = random.choice([1, 0])
    # action = random.choice([1, 0])
    # adventure  = random.choice([1, 0])
    # animation = random.choice([1, 0])
    # children = random.choice([1, 0])
    # comedy = random.choice([1, 0])
    # crime = random.choice([1, 0])
    # documentary = random.choice([1, 0])
    # drama = random.choice([1, 0])
    # fantasy = random.choice([1, 0])
    # film_noir = random.choice([1, 0])
    # horror = random.choice([1, 0])
    # imax = random.choice([1, 0])
    # musical   = random.choice([1, 0])
    # mystery = random.choice([1, 0])
    # romance = random.choice([1, 0])
    # sci_fi = random.choice([1, 0])
    # thriller = random.choice([1, 0])
    # war_western  = random.choice([1, 0])

    provincia = random.choice( [
        "Azuay",
        "Bolívar",
        "Cañar",
        "Carchi",
        "Chimborazo",
        "Cotopaxi",
        "El Oro",
        "Esmeraldas",
        "Galápagos",
        "Guayas",
        "Imbabura",
        "Loja",
        "Los Ríos",
        "Manabí",
        "Morona Santiago",
        "Napo",
        "Orellana",
        "Pastaza",
        "Pichincha",
        "Santa Elena",
        "Santo Domingo de los Tsáchilas",
        "Sucumbíos",
        "Tungurahua",
        "Zamora Chinchipe"
    ])
    
    # fila = [i, nombre, email, edad, genero, provincia, nogenre,action,adventure,animation,children,comedy,crime,documentary,drama,fantasy,film_noir,horror,imax,musical,mystery,romance,sci_fi,thriller,war_western]
    fila = [i, nombre, email, genero, provincia]
    data.append(fila)

In [19]:
# columnas = ['userid', 'nombre', 'email', 'edad', 'genero', 'provincia', 'nogenre','action','adventure','animation','children','comedy','crime','documentary','drama','fantasy','film_noir','horror','imax','musical','mystery','romance','sci_fi','thriller','war_western'] 
columnas = ['userid', 'nombre', 'email', 'genero', 'provincia']

In [20]:
df = pd.DataFrame(data, columns=columnas)

In [21]:
df.head()

,userid,nombre,email,genero,provincia
0,1,Odalys Talavera Villalba,odalys.talavera.villalba@ejemplo.com,F,El Oro
1,2,Gloria Elba Lladó Bertrán,gloria.elba.lladó.bertrán@ejemplo.com,M,Zamora Chinchipe
2,3,Eligio Barriga Seco,eligio.barriga.seco@ejemplo.com,M,Cotopaxi
3,4,Jesús Alcalá Rius,jesús.alcalá.rius@ejemplo.com,F,Napo
4,5,Odalis Íngrid Roura Tomás,odalis.íngrid.roura.tomás@ejemplo.com,F,Morona Santiago

In [23]:
def sin_tilde(email):
    replacements = (("á", "a"), ("é", "e"), ("í", "i"), ("ó", "o"), ("ú", "u"))
    for a, b in replacements:
        email = email.replace(a, b).replace(a.upper(), b.upper())
    return email

In [24]:
df['email'] = df['email'].apply(sin_tilde)

In [25]:
df.head()

,userid,nombre,email,genero,provincia
0,1,Odalys Talavera Villalba,odalys.talavera.villalba@ejemplo.com,F,El Oro
1,2,Gloria Elba Lladó Bertrán,gloria.elba.llado.bertran@ejemplo.com,M,Zamora Chinchipe
2,3,Eligio Barriga Seco,eligio.barriga.seco@ejemplo.com,M,Cotopaxi
3,4,Jesús Alcalá Rius,jesus.alcala.rius@ejemplo.com,F,Napo
4,5,Odalis Íngrid Roura Tomás,odalis.ingrid.roura.tomas@ejemplo.com,F,Morona Santiago

In [26]:
# Guardado de tabla dimension usuarios temporal
df.to_csv(r"../data/usuarios.csv")